In [1]:
#READ DATASET
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
%matplotlib inline

teams_post_data = pd.read_csv("../basketballPlayoffs/teams_post.csv")

In [2]:
# SIZE OF DATA
teams_post_data.shape

(80, 5)

In [3]:
# CHECK FOR DUPLICATED LINES
teams_post_data.duplicated().any()

False

In [4]:
# SEE THE FIRST ROWS
teams_post_data.head()

   year tmID  lgID  W  L
0     1  HOU  WNBA  6  0
1     1  ORL  WNBA  1  2
2     1  CLE  WNBA  3  3
3     1  WAS  WNBA  0  2
4     1  NYL  WNBA  4  3

In [5]:
# DESCRIPTION OF EACH ATTRIBUTE OF THE DATASET
teams_post_data.describe()

            year          W          L
count  80.000000  80.000000  80.000000
mean    5.500000   2.350000   2.350000
std     2.890403   2.228129   0.843441
min     1.000000   0.000000   0.000000
25%     3.000000   1.000000   2.000000
50%     5.500000   1.500000   2.000000
75%     8.000000   3.250000   3.000000
max    10.000000   7.000000   5.000000

In [6]:
# DESCRIPTION OF FUEL ATTRIBUTE OF THE DATASET
teams_post_data.describe(include='object')

       tmID  lgID
count    80    80
unique   18     1
top     LAS  WNBA
freq      9    80

In [7]:
# TYPES
teams_post_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    80 non-null     int64
 1   tmID    80 non-null     object
 2   lgID    80 non-null     object
 3   W       80 non-null     int64
 4   L       80 non-null     int64
dtypes: int64(3), object(2)
memory usage: 3.2+ KB